Revit 2026 API

# ConnectorElementHeight Property

---

The height of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual double Height { get; }
```
```vb
Public Overridable ReadOnly Property Height As Double
	Get
```
```cpp
public:
virtual property double Height {
	double get ();
}
```
```fsharp
abstract Height : float with get
override Height : float with get
```

#### Property Value

Double

#### Implements

IConnectorHeight

-1 if the connector is round.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace